## Laboratorio 04 - SQL parte 3

### Davis Alvarez  - 15842

#### Bienvenida

Bienvenido a su tercer laboratorio de Bases de datos.

El objetivo de este laboratorio es que usted profundice y practique sobre los conceptos de queries anidados (_subqueries_) y la aplicación del concepto de agregación y de las funciones de agregación. Usted deberá conocer la sintaxis de un `SELECT` introduciendo los conceptos de agregación (`GROUP BY`) y filtros sobre datos agregados (`HAVING`).

Para este laboratorio utilizaremos la base de datos **flights-lab3.db** utilizada durante el laboratorio 3.

Recuerde que puede encontrar más información acerca de los campos en: https://www.transtats.bts.gov/DL_SelectFields.asp?Table_ID=236

In [2]:
%load_ext sql

In [3]:
sql sqlite:///flights-lab3.db

'Connected: @flights-lab3.db'

### Ejercicio 1: Consultas SQL (100 puntos)

Prepare un query que responda a cada una de las siguientes preguntas:

In [5]:
%sql PRAGMA table_info(ontime);

 * sqlite:///flights-lab3.db
Done.

[(0, 'Year', 'int', 0, None, 0),
 (1, 'Month', 'int', 0, None, 0),
 (2, 'DayofMonth', 'int', 0, None, 0),
 (3, 'DayOfWeek', 'int', 0, None, 0),
 (4, 'DepTime', 'int', 0, None, 0),
 (5, 'CRSDepTime', 'int', 0, None, 0),
 (6, 'ArrTime', 'int', 0, None, 0),
 (7, 'CRSArrTime', 'int', 0, None, 0),
 (8, 'UniqueCarrier', 'varchar(5)', 0, None, 0),
 (9, 'FlightNum', 'int', 0, None, 0),
 (10, 'TailNum', 'varchar(8)', 0, None, 0),
 (11, 'ActualElapsedTime', 'int', 0, None, 0),
 (12, 'CRSElapsedTime', 'int', 0, None, 0),
 (13, 'AirTime', 'int', 0, None, 0),
 (14, 'ArrDelay', 'int', 0, None, 0),
 (15, 'DepDelay', 'int', 0, None, 0),
 (16, 'Origin', 'varchar(3)', 0, None, 0),
 (17, 'Dest', 'varchar(3)', 0, None, 0),
 (18, 'Distance', 'int', 0, None, 0),
 (19, 'TaxiIn', 'int', 0, None, 0),
 (20, 'TaxiOut', 'int', 0, None, 0),
 (21, 'Cancelled', 'int', 0, None, 0),
 (22, 'CancellationCode', 'varchar(1)', 0, None, 0),
 (23, 'Diverted', 'varchar(1)', 0, None, 0),
 (24, 'CarrierDelay', 'int', 0, None, 0),
 (25, 'WeatherDelay', 'int', 0, None, 0),
 (26, 'NASDelay', 'int', 0, None, 0),
 (27, 'SecurityDelay', 'int', 0, None, 0),
 (28, 'LateAircraftDelay', 'int', 0, None, 0)]

In [6]:
%sql PRAGMA table_info(airports);

 * sqlite:///flights-lab3.db
Done.

[(0, 'iata', 'varchar(4)', 0, None, 0),
 (1, 'airport', 'varchar(100)', 0, None, 0),
 (2, 'city', 'varchar(100)', 0, None, 0),
 (3, 'state', 'varchar(4)', 0, None, 0),
 (4, 'country', 'varchar(4)', 0, None, 0),
 (5, 'lat', 'double', 0, None, 0),
 (6, 'long', 'double', 0, None, 0)]

#### Pregunta 1: ¿Qué aerolineas vuelan de California a Nueva York?

Su respuesta debe mostrar el nombre de la aerolinea.

De su respuesta utilizando subqueries.

In [13]:
%%sql SELECT L.UniqueCarrier, airlines.AirlineName
        FROM(
            SELECT DISTINCT O.UniqueCarrier, ORIGEN.state, DESTINO.state
            FROM ontime O
                INNER JOIN airports ORIGEN ON O.origin=ORIGEN.iata
                INNER JOIN airports DESTINO ON O.dest=DESTINO.iata
            WHERE ORIGEN.state='CA' AND DESTINO.state='NY'
        ) L
            INNER JOIN airlines ON airlines.AirlineCode = L.UniqueCarrier

 * sqlite:///flights-lab3.db
Done.

[('AA', 'American Airlines Inc.'),
 ('B6', 'JetBlue Airways'),
 ('DL', 'Delta Air Lines Inc.'),
 ('UA', 'United Air Lines Inc.')]

_Hint:_ Deben ser cuatro aerolineas

#### Pregunta 2: ¿Qué aerolineas vuelan de California a Nueva York y también de California a Nuevo México?

Su respuesta debe mostrar el nombre de las aerolineas

De su respuesta en términos de subqueries.

In [20]:
%%sql SELECT L.UniqueCarrier, airlines.AirlineName
        FROM(
            SELECT DISTINCT O.UniqueCarrier, ORIGEN.state, DESTINO.state
            FROM ontime O
                INNER JOIN airports ORIGEN ON O.origin=ORIGEN.iata
                INNER JOIN airports DESTINO ON O.dest=DESTINO.iata
            WHERE ORIGEN.state='CA' AND DESTINO.state='NY'
        ) L
            INNER JOIN airlines ON airlines.AirlineCode = L.UniqueCarrier
        WHERE UniqueCarrier IN (
                                    SELECT DISTINCT O.UniqueCarrier
                                        FROM ontime O
                                            INNER JOIN airports ORIGEN ON O.origin=ORIGEN.iata
                                            INNER JOIN airports DESTINO ON O.dest=DESTINO.iata
                                        WHERE ORIGEN.state='CA' AND DESTINO.state='NM'
                                    )

 * sqlite:///flights-lab3.db
Done.

[('UA', 'United Air Lines Inc.')]

#### Pregunta 3. ¡Quiero maximizar mi millas! (15 puntos)

Suponga que en un futuro no muy lejano le gustaría visitar tanto Portland (PDX) como Eugene (EUG), saliendo desde SFO. Con el objetivo de maximizar mis millas de viajero frecuente, me gustaría utilizar la misma aerolínea para ambos vuelos.

Escriba un query que muestre los nombres de las aerolíneas que realizaron tanto vuelos SFO -> PDX como vuelos SFO -> EUG.
Asegúrese de mostrar el nombre de las aerolíneas sin duplicados.

In [24]:
%%sql SELECT L.UniqueCarrier, airlines.AirlineName
        FROM(
            SELECT DISTINCT O.UniqueCarrier, ORIGEN.state, DESTINO.state
            FROM ontime O
                INNER JOIN airports ORIGEN ON O.origin=ORIGEN.iata
                INNER JOIN airports DESTINO ON O.dest=DESTINO.iata
            WHERE ORIGEN.iata='SFO' AND DESTINO.iata='EUG'
        ) L
            INNER JOIN airlines ON airlines.AirlineCode = L.UniqueCarrier
        WHERE UniqueCarrier IN (
                                    SELECT DISTINCT O.UniqueCarrier
                                        FROM ontime O
                                            INNER JOIN airports ORIGEN ON O.origin=ORIGEN.iata
                                            INNER JOIN airports DESTINO ON O.dest=DESTINO.iata
                                        WHERE ORIGEN.iata='SFO' AND DESTINO.iata='PDX'
                                    )

 * sqlite:///flights-lab3.db
Done.

[('OO', 'SkyWest Airlines Inc.'), ('UA', 'United Air Lines Inc.')]

_Respuesta:_
```
SkyWest Airlines Inc.
United Air Lines Inc.
```

#### Pregunta 4: ¿Existen aerolineas que hagan únicamente vuelos internos?

Un vuelo interno es aquel cuyo aeropuerto origen y aeropuerto destino se encuentran en el mismo estado.

De su respuesta en términos de `EXCEPT`.

In [40]:
%%sql SELECT DISTINCT O.UniqueCarrier, airlines.AirlineName
        FROM ontime O
            INNER JOIN airports ORIGEN ON O.origin=ORIGEN.iata
            INNER JOIN airports DESTINO ON O.dest=DESTINO.iata
            INNER JOIN airlines ON airlines.AirlineCode = O.UniqueCarrier
        WHERE ORIGEN.state=DESTINO.state
EXCEPT
SELECT DISTINCT O.UniqueCarrier, airlines.AirlineName
        FROM ontime O
            INNER JOIN airports ORIGEN ON O.origin=ORIGEN.iata
            INNER JOIN airports DESTINO ON O.dest=DESTINO.iata
            INNER JOIN airlines ON airlines.AirlineCode = O.UniqueCarrier
        WHERE ORIGEN.state!=DESTINO.state

 * sqlite:///flights-lab3.db
Done.

[]

_Respuesta:_ En la base de datos no hay ninguna aerolinea que haga únicamente vuelos internos.

#### Pregunta 5: ¿Qué proporción de aerolineas se retrasan en llegar un promedio 10 minutos o más con respecto al total de aerolíneas que han operado vuelos? (20 puntos)

En el laboratorio 3 usted desarrolló un query para mostrar qué aerolineas se retrasan en llegar un promedio 10 minutos o más.

Escriba ahora un query que retorne la proporción de las aerolíneas que se retrasan en promedio 10 minutos o más, con respecto a la cantidad de aerolíneas que operaron vuelos.

Recuerde no quemar (_hardcode_) la cantidad de aerolíneas disponibles, sino obtener la cantidad a partir de un query.

**Nota**: la función `COUNT(*)` en SQLite retorna valores de tipo integer, por lo que deberá investigar e incluir en su query una conversión (_casteing_) de valores utilizando la función `CAST`: `SELECT CAST (COUNT(*) AS float)` o bien un cast implícito derivado de una operación: `COUNT(*) * 1.0`.

In [66]:
%%sql SELECT (COUNT(airlineName)* 1.0 / (SELECT COUNT(UniqueCarrier)* 1.0 AS total2
                                            FROM(
                                                SELECT *
                                                FROM ontime O
                                                GROUP BY UniqueCarrier
                                            ) ACTIVAS)) AS Proporcion
        FROM(
            SELECT airlines.airlineName
            FROM ontime
                INNER JOIN airlines ON ontime.UniqueCarrier= Airlines.AirlineCode
            GROUP BY UniqueCarrier
                HAVING AVG(ArrDelay)>=10.0
        ) RETRA

 * sqlite:///flights-lab3.db
Done.

[(0.4,)]

_Respuesta: La proporción de aerolineas que se retrasan más de 10 minutos en promedio representa el 40% de las aerolineas que operan vuelos_

#### Pregunta 6: ¿Cómo se relacionan los retrasos en el tiempo de salida (departure) con los retrasos en el tiempo de llegada (arrival)? (30 puntos)

Si un vuelo se retrasa al salir, nos interesa estudiar qué tanto afecta esto al tiempo de llegada.

Una forma de estudiar la variación conjunta de dos variables es utilizar la _covarianza muestral_.

(Sí, por favor refrésquelo: https://www.google.com/search?q=covarianza+muestral)

Mientras más alto sea el valor de la covarianza muestral entre dos variables, mayor será la tendencia de estas a comportarse de la misma forma. Por el contrario, una covarianza negativa indica que las variables tienden a estar inversamente relacionadas.

Una forma de computar la covarianza es como sigue:

\begin{equation}
    Cov (X, Y) = \dfrac{1}{n-1}\sum_{i=1}^{n}(x_i - \overline{x})(y_i - \overline{y})
\end{equation}

En donde $x_i$ denota la $i$ muestra de la variable $X$, $y_i$ la muestra $i$ de la variable $Y$; mientras que  las medias de $X$ y $Y$ son denotadas por $\overline{x}$ y $\overline{y}$ respectivamente.

El objetivo de este ejercicio es construir un query que compute la covarianza entre el retraso en el tiempo de salida (`ontime.DepDelay`) y el retraso en el tiempo de llegada (`ontime.ArrDelay`). Para eso trabaje los siguientes incisos:

Nota: recuerde que puede utilizar `%%sql` en Jupyter Notebook para escribir queries utilizando múltiples líneas.

##### 6.a

Escriba un query para computar el término $1/(n-1)$ de la tabla de vuelos, en donde $n$ representa la cantidad de vuelos disponibles:

In [13]:
%%sql SELECT (1/t1) as a
        FROM (SELECT (COUNT(*)* 1.0-1) AS t1 FROM ontime)

 * sqlite:///flights-lab3.db
Done.

[(1.426589081143959e-07,)]

_Respuesta:_ Su query debería retornar el valor `1.42658908114e-07`

##### 6.b

Escriba un query para que devuelva la siguiente el producto $(x_i - \overline{x})(y_i - \overline{y})$ para los primeros 10 registros de la tabla de vuelos:

In [20]:
%%sql SELECT (x*y) AS xy
        FROM(
            SELECT (DepDelay-(SELECT AVG(DepDelay) FROM ontime)) AS x,
                 (ArrDelay-(SELECT AVG(ArrDelay) FROM ontime)) AS y
                FROM ontime
                limit 10
        ) AS b

 * sqlite:///flights-lab3.db
Done.

[(39.111174188232944,),
 (-55.218599235215166,),
 (-10.693439628451538,),
 (192.7394599077359,),
 (630.0391228903794,),
 (45.843687204429855,),
 (2804.5182078135035,),
 (280.11975055524744,),
 (46.580482555119644,),
 (234.5740968579856,)]

#### 6.c

Escriba un query que utilice la consulta anterior compute la suma de los $n$ registros de la tabla de vuelos, es decir el término

\begin{equation}
    \sum_{i=1}^{n}(x_i - \overline{x})(y_i - \overline{y})
\end{equation}

In [23]:
%%sql SELECT SUM(xy) AS sumac
        FROM(
            SELECT (x*y) AS xy
        FROM(
            SELECT (DepDelay-(SELECT AVG(DepDelay) FROM ontime)) AS x,
                 (ArrDelay-(SELECT AVG(ArrDelay) FROM ontime)) AS y
                FROM ontime
        ) AS b
        ) AS c

 * sqlite:///flights-lab3.db
Done.

[(8662069188.193983,)]

##### 6.d

Escriba un query que utilizando las consultas de los incisos (a) y (c) para computar la covarianza.

In [25]:
%%sql SELECT (sumac*(SELECT (1/t1) as a FROM (SELECT (COUNT(*)* 1.0-1) AS t1 FROM ontime))) AS covarianza
      FROM (
          SELECT SUM(xy) AS sumac
            FROM(
                SELECT (x*y) AS xy
            FROM(
                SELECT (DepDelay-(SELECT AVG(DepDelay) FROM ontime)) AS x,
                     (ArrDelay-(SELECT AVG(ArrDelay) FROM ontime)) AS y
                    FROM ontime
            ) AS b
            ) AS c
      ) AS d

 * sqlite:///flights-lab3.db
Done.

[(1235.7213323991052,)]

_Respuesta: La covarianza entre el tiempo de salida y el tiempo de llegada en los vuelos del dataset es de 1,235.72_